#### R-like dataframe can be made in Python using the pandas package

In [5]:
import pandas as pd
import scipy as sc

In [6]:
pd.__version__

'1.3.4'

`pd.<TAB>` will show all the functions avaialble from the package pd   
`?pd` will display the built-in documentation of pd

In [10]:
?pd

In [15]:
# Loading files as dataframe
MyDF = pd.read_csv("../data/testcsv.csv")
MyDF

,Species,Infraorder,Family,Distribution,Body mass male (Kg)
0,Daubentonia_madagascariensis,Chiromyiformes,Daubentoniidae,Madagascar,2.700
1,Allocebus_trichotis,Lemuriformes,Cheirogaleidae,Madagascar,0.100
2,Avahi_laniger,Lemuriformes,Indridae,America,1.030
3,Avahi_occidentalis,Lemuriformes,Indridae,Madagascar,0.814
4,Avahi_unicolor,Lemuriformes,Indridae,America,0.830
5,Cheirogaleus_adipicaudatus,Lemuriformes,Cheirogaleidae,Madagascar,0.200
6,Cheirogaleus_crossleyi,Lemuriformes,Cheirogaleidae,Madagascar,0.400
7,Cheirogaleus_major,Lemuriformes,Cheirogaleidae,Madagascar,0.450
8,Cheirogaleus_medius,Lemuriformes,Cheirogaleidae,Madagascar,0.217

In [16]:
type(MyDF)

pandas.core.frame.DataFrame

In [18]:
# Making dataframe from scratch 
MyDF = pd.DataFrame({
    'col1': ['Var1', 'Var2', 'Var3', 'Var4'],
    'col2': ['Grass', 'Rabbit', 'Fox', 'Wolf'],
    'col3': [1,2,sc.nan,4]
})
MyDF

   col1    col2  col3
0  Var1   Grass   1.0
1  Var2  Rabbit   2.0
2  Var3     Fox   NaN
3  Var4    Wolf   4.0

In [20]:
MyDF.head() # Displays the top 5 rows or specified integer value in ()

   col1    col2  col3
0  Var1   Grass   1.0
1  Var2  Rabbit   2.0
2  Var3     Fox   NaN
3  Var4    Wolf   4.0

In [22]:
MyDF.shape # Shows dimention of dataframe

(4, 3)

In [24]:
len(MyDF) # Number of colums

col1     object
col2     object
col3    float64
dtype: object

In [27]:
MyDF.columns # list the name of columns in an array

Index(['col1', 'col2', 'col3'], dtype='object')

In [26]:
MyDF.dtypes # columns and their types

col1     object
col2     object
col3    float64
dtype: object

In [28]:
MyDF.values # Converts the frame to a two-dimentional table

array([['Var1', 'Grass', 1.0],
       ['Var2', 'Rabbit', 2.0],
       ['Var3', 'Fox', nan],
       ['Var4', 'Wolf', 4.0]], dtype=object)

In [29]:
MyDF.describe() # Describes the stats for all columns

           col3
count  3.000000
mean   2.333333
std    1.527525
min    1.000000
25%    1.500000
50%    2.000000
75%    3.000000
max    4.000000